Диплом2026резерв/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПерсонала</name>
    <type>
      <types>EnumRef.ВКМ_КатегорииПерсонала</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Диплом2026резерв/src/Enums/ВКМ_КатегорииПерсонала/ВКМ_КатегорииПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорииПерсонала</name>
  <enumValues>
    <name>Специалисты</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

Диплом2026резерв/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КатегорияПерсоналаПриИзменении(Элемент)
	КатегорияПерсоналаПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура КатегорияПерсоналаПриИзмененииНаСервере()
	
	Запись.Оклад = 0;
	
	Если Запись.КатегорияПерсонала = Перечисления.ВКМ_КатегорииПерсонала.Специалисты Тогда
		
		МинимальныйОклад = Константы.ВКМ_МинимальныйОклад.Получить();
		
		Если МинимальныйОклад = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю("Минимальный оклад не указан!");
		Иначе 
			Запись.Оклад = Константы.ВКМ_МинимальныйОклад.Получить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
